;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v5.1.1 *
;* Date/Time created: Tue Dec 16 14:29:52 2008                 *
;***************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --silicon_version=28 --symdebug:skeletal 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.1.1 Copyright (c) 1996-2008 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("J:\data\maze_project\koguryov2\algo")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_BattSum$2$14+0,32
	.field  	6700,16			; _BattSum$2$14 @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_fSwichTop+0,32
	.field  	0,16			; _fSwichTop @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_ModeSelect+0,32
	.field  	0,16			; _ModeSelect @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_fSwichRight+0,32
	.field  	0,16			; _fSwichRight @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_ADChanelCnt$1$17+0,32
	.field  	0,16			; _ADChanelCnt$1$17 @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16

	.dwattr $C$DW$T$549, DW_AT_type(*$C$DW$2436)

$C$DW$T$550	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$550, DW_AT_type(*$C$DW$T$549)
	.dwattr $C$DW$T$550, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$550, DW_AT_byte_size(0x08)
$C$DW$2437	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$2437, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$550

$C$DW$T$551	.dwtag  DW_TAG_typedef, DW_AT_name("_iq16")
	.dwattr $C$DW$T$551, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$551, DW_AT_language(DW_LANG_C)
$C$DW$T$552	.dwtag  DW_TAG_typedef, DW_AT_name("_iq15")
	.dwattr $C$DW$T$552, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$552, DW_AT_language(DW_LANG_C)
$C$DW$T$553	.dwtag  DW_TAG_typedef, DW_AT_name("_iq14")
	.dwattr $C$DW$T$553, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$553, DW_AT_language(DW_LANG_C)
$C$DW$T$554	.dwtag  DW_TAG_typedef, DW_AT_name("_iq13")
	.dwattr $C$DW$T$554, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$554, DW_AT_language(DW_LANG_C)
$C$DW$2438	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2438, DW_AT_type(*$C$DW$T$554)
$C$DW$T$555	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$555, DW_AT_type(*$C$DW$2438)
$C$DW$T$556	.dwtag  DW_TAG_typedef, DW_AT_name("_iq11")
	.dwattr $C$DW$T$556, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$556, DW_AT_language(DW_LANG_C)
$C$DW$T$557	.dwtag  DW_TAG_typedef, DW_AT_name("_iq10")
	.dwattr $C$DW$T$557, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$557, DW_AT_language(DW_LANG_C)
$C$DW$T$558	.dwtag  DW_TAG_typedef, DW_AT_name("_iq9")
	.dwattr $C$DW$T$558, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$558, DW_AT_language(DW_LANG_C)
$C$DW$T$559	.dwtag  DW_TAG_typedef, DW_AT_name("_iq8")
	.dwattr $C$DW$T$559, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$559, DW_AT_language(DW_LANG_C)
$C$DW$T$560	.dwtag  DW_TAG_typedef, DW_AT_name("_iq7")
	.dwattr $C$DW$T$560, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$560, DW_AT_language(DW_LANG_C)
$C$DW$T$561	.dwtag  DW_TAG_typedef, DW_AT_name("_iq6")
	.dwattr $C$DW$T$561, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$561, DW_AT_language(DW_LANG_C)
$C$DW$T$562	.dwtag  DW_TAG_typedef, DW_AT_name("_iq5")
	.dwattr $C$DW$T$562, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$562, DW_AT_language(DW_LANG_C)
$C$DW$T$563	.dwtag  DW_TAG_typedef, DW_AT_name("_iq4")
	.dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$563, DW_AT_language(DW_LANG_C)
$C$DW$T$564	.dwtag  DW_TAG_typedef, DW_AT_name("_iq3")
	.dwattr $C$DW$T$564, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$564, DW_AT_language(DW_LANG_C)
$C$DW$T$565	.dwtag  DW_TAG_typedef, DW_AT_name("_iq2")
	.dwattr $C$DW$T$565, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$565, DW_AT_language(DW_LANG_C)
$C$DW$T$566	.dwtag  DW_TAG_typedef, DW_AT_name("_iq1")
	.dwattr $C$DW$T$566, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$566, DW_AT_language(DW_LANG_C)
$C$DW$T$567	.dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
	.dwattr $C$DW$T$567, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$567, DW_AT_language(DW_LANG_C)
$C$DW$2439	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2439, DW_AT_type(*$C$DW$T$12)
$C$DW$T$575	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$575, DW_AT_type(*$C$DW$2439)
$C$DW$T$576	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$576, DW_AT_type(*$C$DW$T$575)
	.dwattr $C$DW$T$576, DW_AT_address_class(0x16)
$C$DW$2440	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2440, DW_AT_type(*$C$DW$T$576)
$C$DW$T$578	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$578, DW_AT_type(*$C$DW$2440)

$C$DW$T$579	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$579, DW_AT_type(*$C$DW$T$578)
	.dwattr $C$DW$T$579, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$579, DW_AT_byte_size(0x08)
$C$DW$2441	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$2441, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$579

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
$C$DW$2442	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2442, DW_AT_type(*$C$DW$T$21)
$C$DW$T$591	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$591, DW_AT_type(*$C$DW$2442)
$C$DW$T$375	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$595	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$595, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$595, DW_AT_language(DW_LANG_C)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
$C$DW$T$607	.dwtag  DW_TAG_typedef, DW_AT_name("float64")
	.dwattr $C$DW$T$607, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$607, DW_AT_language(DW_LANG_C)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("GPADAT_BITS")
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
$C$DW$2443	.dwtag  DW_TAG_member
	.dwattr $C$DW$2443, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2443, DW_AT_name("GPIO0")
	.dwattr $C$DW$2443, DW_AT_TI_symbol_name("_GPIO0")
	.dwattr $C$DW$2443, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2444	.dwtag  DW_TAG_member
	.dwattr $C$DW$2444, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2444, DW_AT_name("GPIO1")
	.dwattr $C$DW$2444, DW_AT_TI_symbol_name("_GPIO1")
	.dwattr $C$DW$2444, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2445	.dwtag  DW_TAG_member
	.dwattr $C$DW$2445, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2445, DW_AT_name("GPIO2")
	.dwattr $C$DW$2445, DW_AT_TI_symbol_name("_GPIO2")
	.dwattr $C$DW$2445, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2446	.dwtag  DW_TAG_member
	.dwattr $C$DW$2446, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2446, DW_AT_name("GPIO3")
	.dwattr $C$DW$2446, DW_AT_TI_symbol_name("_GPIO3")
	.dwattr $C$DW$2446, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2447	.dwtag  DW_TAG_member
	.dwattr $C$DW$2447, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2447, DW_AT_name("GPIO4")
	.dwattr $C$DW$2447, DW_AT_TI_symbol_name("_GPIO4")
	.dwattr $C$DW$2447, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2448	.dwtag  DW_TAG_member
	.dwattr $C$DW$2448, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2448, DW_AT_name("GPIO5")
	.dwattr $C$DW$2448, DW_AT_TI_symbol_name("_GPIO5")
	.dwattr $C$DW$2448, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2449	.dwtag  DW_TAG_member
	.dwattr $C$DW$2449, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2449, DW_AT_name("GPIO6")
	.dwattr $C$DW$2449, DW_AT_TI_symbol_name("_GPIO6")
	.dwattr $C$DW$2449, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2450	.dwtag  DW_TAG_member
	.dwattr $C$DW$2450, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2450, DW_AT_name("GPIO7")
	.dwattr $C$DW$2450, DW_AT_TI_symbol_name("_GPIO7")
	.dwattr $C$DW$2450, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2451	.dwtag  DW_TAG_member
	.dwattr $C$DW$2451, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2451, DW_AT_name("GPIO8")
	.dwattr $C$DW$2451, DW_AT_TI_symbol_name("_GPIO8")
	.dwattr $C$DW$2451, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2452	.dwtag  DW_TAG_member
	.dwattr $C$DW$2452, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2452, DW_AT_name("GPIO9")
	.dwattr $C$DW$2452, DW_AT_TI_symbol_name("_GPIO9")
	.dwattr $C$DW$2452, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2453	.dwtag  DW_TAG_member
	.dwattr $C$DW$2453, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2453, DW_AT_name("GPIO10")
	.dwattr $C$DW$2453, DW_AT_TI_symbol_name("_GPIO10")
	.dwattr $C$DW$2453, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2454	.dwtag  DW_TAG_member
	.dwattr $C$DW$2454, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2454, DW_AT_name("GPIO11")
	.dwattr $C$DW$2454, DW_AT_TI_symbol_name("_GPIO11")
	.dwattr $C$DW$2454, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2455	.dwtag  DW_TAG_member
	.dwattr $C$DW$2455, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2455, DW_AT_name("GPIO12")
	.dwattr $C$DW$2455, DW_AT_TI_symbol_name("_GPIO12")
	.dwattr $C$DW$2455, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2456	.dwtag  DW_TAG_member
	.dwattr $C$DW$2456, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2456, DW_AT_name("GPIO13")
	.dwattr $C$DW$2456, DW_AT_TI_symbol_name("_GPIO13")
	.dwattr $C$DW$2456, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2457	.dwtag  DW_TAG_member
	.dwattr $C$DW$2457, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2457, DW_AT_name("GPIO14")
	.dwattr $C$DW$2457, DW_AT_TI_symbol_name("_GPIO14")
	.dwattr $C$DW$2457, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2458	.dwtag  DW_TAG_member
	.dwattr $C$DW$2458, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2458, DW_AT_name("GPIO15")
	.dwattr $C$DW$2458, DW_AT_TI_symbol_name("_GPIO15")
	.dwattr $C$DW$2458, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2459	.dwtag  DW_TAG_member
	.dwattr $C$DW$2459, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2459, DW_AT_name("GPIO16")
	.dwattr $C$DW$2459, DW_AT_TI_symbol_name("_GPIO16")
	.dwattr $C$DW$2459, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2460	.dwtag  DW_TAG_member
	.dwattr $C$DW$2460, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2460, DW_AT_name("GPIO17")
	.dwattr $C$DW$2460, DW_AT_TI_symbol_name("_GPIO17")
	.dwattr $C$DW$2460, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2461	.dwtag  DW_TAG_member
	.dwattr $C$DW$2461, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2461, DW_AT_name("GPIO18")
	.dwattr $C$DW$2461, DW_AT_TI_symbol_name("_GPIO18")
	.dwattr $C$DW$2461, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2462	.dwtag  DW_TAG_member
	.dwattr $C$DW$2462, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2462, DW_AT_name("GPIO19")
	.dwattr $C$DW$2462, DW_AT_TI_symbol_name("_GPIO19")
	.dwattr $C$DW$2462, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2463	.dwtag  DW_TAG_member
	.dwattr $C$DW$2463, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2463, DW_AT_name("GPIO20")
	.dwattr $C$DW$2463, DW_AT_TI_symbol_name("_GPIO20")
	.dwattr $C$DW$2463, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2464	.dwtag  DW_TAG_member
	.dwattr $C$DW$2464, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2464, DW_AT_name("GPIO21")
	.dwattr $C$DW$2464, DW_AT_TI_symbol_name("_GPIO21")
	.dwattr $C$DW$2464, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2465	.dwtag  DW_TAG_member
	.dwattr $C$DW$2465, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2465, DW_AT_name("GPIO22")
	.dwattr $C$DW$2465, DW_AT_TI_symbol_name("_GPIO22")
	.dwattr $C$DW$2465, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2466	.dwtag  DW_TAG_member
	.dwattr $C$DW$2466, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2466, DW_AT_name("GPIO23")
	.dwattr $C$DW$2466, DW_AT_TI_symbol_name("_GPIO23")
	.dwattr $C$DW$2466, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2467	.dwtag  DW_TAG_member
	.dwattr $C$DW$2467, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2467, DW_AT_name("GPIO24")
	.dwattr $C$DW$2467, DW_AT_TI_symbol_name("_GPIO24")
	.dwattr $C$DW$2467, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2468	.dwtag  DW_TAG_member
	.dwattr $C$DW$2468, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2468, DW_AT_name("GPIO25")
	.dwattr $C$DW$2468, DW_AT_TI_symbol_name("_GPIO25")
	.dwattr $C$DW$2468, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2469	.dwtag  DW_TAG_member
	.dwattr $C$DW$2469, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2469, DW_AT_name("GPIO26")
	.dwattr $C$DW$2469, DW_AT_TI_symbol_name("_GPIO26")
	.dwattr $C$DW$2469, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2470	.dwtag  DW_TAG_member
	.dwattr $C$DW$2470, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2470, DW_AT_name("GPIO27")
	.dwattr $C$DW$2470, DW_AT_TI_symbol_name("_GPIO27")
	.dwattr $C$DW$2470, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2471	.dwtag  DW_TAG_member
	.dwattr $C$DW$2471, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2471, DW_AT_name("GPIO28")
	.dwattr $C$DW$2471, DW_AT_TI_symbol_name("_GPIO28")
	.dwattr $C$DW$2471, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2472	.dwtag  DW_TAG_member
	.dwattr $C$DW$2472, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2472, DW_AT_name("GPIO29")
	.dwattr $C$DW$2472, DW_AT_TI_symbol_name("_GPIO29")
	.dwattr $C$DW$2472, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2473	.dwtag  DW_TAG_member
	.dwattr $C$DW$2473, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2473, DW_AT_name("GPIO30")
	.dwattr $C$DW$2473, DW_AT_TI_symbol_name("_GPIO30")
	.dwattr $C$DW$2473, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2473, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2474	.dwtag  DW_TAG_member
	.dwattr $C$DW$2474, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2474, DW_AT_name("GPIO31")
	.dwattr $C$DW$2474, DW_AT_TI_symbol_name("_GPIO31")
	.dwattr $C$DW$2474, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2474, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2474, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$20


$C$DW$T$22	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$22, DW_AT_name("GPADAT_REG")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
$C$DW$2475	.dwtag  DW_TAG_member
	.dwattr $C$DW$2475, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$2475, DW_AT_name("all")
	.dwattr $C$DW$2475, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2476	.dwtag  DW_TAG_member
	.dwattr $C$DW$2476, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$2476, DW_AT_name("bit")
	.dwattr $C$DW$2476, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2476, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_name("GPBDAT_BITS")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
$C$DW$2477	.dwtag  DW_TAG_member
	.dwattr $C$DW$2477, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2477, DW_AT_name("GPIO32")
	.dwattr $C$DW$2477, DW_AT_TI_symbol_name("_GPIO32")
	.dwattr $C$DW$2477, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2478	.dwtag  DW_TAG_member
	.dwattr $C$DW$2478, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2478, DW_AT_name("GPIO33")
	.dwattr $C$DW$2478, DW_AT_TI_symbol_name("_GPIO33")
	.dwattr $C$DW$2478, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2479	.dwtag  DW_TAG_member
	.dwattr $C$DW$2479, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2479, DW_AT_name("GPIO34")
	.dwattr $C$DW$2479, DW_AT_TI_symbol_name("_GPIO34")
	.dwattr $C$DW$2479, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2480	.dwtag  DW_TAG_member
	.dwattr $C$DW$2480, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2480, DW_AT_name("rsvd1")
	.dwattr $C$DW$2480, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2480, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2481	.dwtag  DW_TAG_member
	.dwattr $C$DW$2481, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2481, DW_AT_name("rsvd2")
	.dwattr $C$DW$2481, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2481, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr $C$DW$2481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2482	.dwtag  DW_TAG_member
	.dwattr $C$DW$2482, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2482, DW_AT_name("rsvd3")
	.dwattr $C$DW$2482, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$2482, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr $C$DW$2482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2482, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$23


$C$DW$T$24	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$24, DW_AT_name("GPBDAT_REG")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
$C$DW$2483	.dwtag  DW_TAG_member
	.dwattr $C$DW$2483, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$2483, DW_AT_name("all")
	.dwattr $C$DW$2483, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2484	.dwtag  DW_TAG_member
	.dwattr $C$DW$2484, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$2484, DW_AT_name("bit")
	.dwattr $C$DW$2484, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2484, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("GPIO_DATA_REGS")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
$C$DW$2485	.dwtag  DW_TAG_member
	.dwattr $C$DW$2485, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$2485, DW_AT_name("GPADAT")
	.dwattr $C$DW$2485, DW_AT_TI_symbol_name("_GPADAT")
	.dwattr $C$DW$2485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2486	.dwtag  DW_TAG_member
	.dwattr $C$DW$2486, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$2486, DW_AT_name("GPASET")
	.dwattr $C$DW$2486, DW_AT_TI_symbol_name("_GPASET")
	.dwattr $C$DW$2486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2487	.dwtag  DW_TAG_member
	.dwattr $C$DW$2487, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$2487, DW_AT_name("GPACLEAR")
	.dwattr $C$DW$2487, DW_AT_TI_symbol_name("_GPACLEAR")
	.dwattr $C$DW$2487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2488	.dwtag  DW_TAG_member
	.dwattr $C$DW$2488, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$2488, DW_AT_name("GPATOGGLE")
	.dwattr $C$DW$2488, DW_AT_TI_symbol_name("_GPATOGGLE")
	.dwattr $C$DW$2488, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$2488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2489	.dwtag  DW_TAG_member
	.dwattr $C$DW$2489, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$2489, DW_AT_name("GPBDAT")
	.dwattr $C$DW$2489, DW_AT_TI_symbol_name("_GPBDAT")
	.dwattr $C$DW$2489, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2490	.dwtag  DW_TAG_member
	.dwattr $C$DW$2490, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$2490, DW_AT_name("GPBSET")
	.dwattr $C$DW$2490, DW_AT_TI_symbol_name("_GPBSET")
	.dwattr $C$DW$2490, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$2490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2491	.dwtag  DW_TAG_member
	.dwattr $C$DW$2491, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$2491, DW_AT_name("GPBCLEAR")
	.dwattr $C$DW$2491, DW_AT_TI_symbol_name("_GPBCLEAR")
	.dwattr $C$DW$2491, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2492	.dwtag  DW_TAG_member
	.dwattr $C$DW$2492, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$2492, DW_AT_name("GPBTOGGLE")
	.dwattr $C$DW$2492, DW_AT_TI_symbol_name("_GPBTOGGLE")
	.dwattr $C$DW$2492, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$2492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2493	.dwtag  DW_TAG_member
	.dwattr $C$DW$2493, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$2493, DW_AT_name("rsvd1")
	.dwattr $C$DW$2493, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2493, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2493, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$26

$C$DW$2494	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2494, DW_AT_type(*$C$DW$T$26)
$C$DW$T$617	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$617, DW_AT_type(*$C$DW$2494)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_name("Path")
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
$C$DW$2495	.dwtag  DW_TAG_member
	.dwattr $C$DW$2495, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2495, DW_AT_name("Position")
	.dwattr $C$DW$2495, DW_AT_TI_symbol_name("_Position")
	.dwattr $C$DW$2495, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2496	.dwtag  DW_TAG_member
	.dwattr $C$DW$2496, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2496, DW_AT_name("TurnDir")
	.dwattr $C$DW$2496, DW_AT_TI_symbol_name("_TurnDir")
	.dwattr $C$DW$2496, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2497	.dwtag  DW_TAG_member
	.dwattr $C$DW$2497, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2497, DW_AT_name("MouseDir")
	.dwattr $C$DW$2497, DW_AT_TI_symbol_name("_MouseDir")
	.dwattr $C$DW$2497, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2498	.dwtag  DW_TAG_member
	.dwattr $C$DW$2498, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2498, DW_AT_name("PathCnt")
	.dwattr $C$DW$2498, DW_AT_TI_symbol_name("_PathCnt")
	.dwattr $C$DW$2498, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2498, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2499	.dwtag  DW_TAG_member
	.dwattr $C$DW$2499, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2499, DW_AT_name("PathState")
	.dwattr $C$DW$2499, DW_AT_TI_symbol_name("_PathState")
	.dwattr $C$DW$2499, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2499, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2499, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$27

$C$DW$2500	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2500, DW_AT_type(*$C$DW$T$27)
$C$DW$T$619	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$619, DW_AT_type(*$C$DW$2500)

$C$DW$T$620	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$620, DW_AT_type(*$C$DW$T$619)
	.dwattr $C$DW$T$620, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$620, DW_AT_byte_size(0x200)
$C$DW$2501	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$2501, DW_AT_upper_bound(0xff)
	.dwendtag $C$DW$T$620


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_name("bit")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
$C$DW$2502	.dwtag  DW_TAG_member
	.dwattr $C$DW$2502, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2502, DW_AT_name("Weight")
	.dwattr $C$DW$2502, DW_AT_TI_symbol_name("_Weight")
	.dwattr $C$DW$2502, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr $C$DW$2502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2503	.dwtag  DW_TAG_member
	.dwattr $C$DW$2503, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2503, DW_AT_name("NowVector")
	.dwattr $C$DW$2503, DW_AT_TI_symbol_name("_NowVector")
	.dwattr $C$DW$2503, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2504	.dwtag  DW_TAG_member
	.dwattr $C$DW$2504, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2504, DW_AT_name("YetVector")
	.dwattr $C$DW$2504, DW_AT_TI_symbol_name("_YetVector")
	.dwattr $C$DW$2504, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2505	.dwtag  DW_TAG_member
	.dwattr $C$DW$2505, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2505, DW_AT_name("BlockCnt")
	.dwattr $C$DW$2505, DW_AT_TI_symbol_name("_BlockCnt")
	.dwattr $C$DW$2505, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x06)
	.dwattr $C$DW$2505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2506	.dwtag  DW_TAG_member
	.dwattr $C$DW$2506, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2506, DW_AT_name("BlockState")
	.dwattr $C$DW$2506, DW_AT_TI_symbol_name("_BlockState")
	.dwattr $C$DW$2506, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
	.dwattr $C$DW$2506, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2506, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$28


$C$DW$T$29	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
$C$DW$2507	.dwtag  DW_TAG_member
	.dwattr $C$DW$2507, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$2507, DW_AT_name("ALL_UINT")
	.dwattr $C$DW$2507, DW_AT_TI_symbol_name("_ALL_UINT")
	.dwattr $C$DW$2507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2508	.dwtag  DW_TAG_member
	.dwattr $C$DW$2508, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$2508, DW_AT_name("Divide")
	.dwattr $C$DW$2508, DW_AT_TI_symbol_name("_Divide")
	.dwattr $C$DW$2508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2508, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$29

$C$DW$T$624	.dwtag  DW_TAG_typedef, DW_AT_name("MapVariable")
	.dwattr $C$DW$T$624, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$624, DW_AT_language(DW_LANG_C)
$C$DW$2509	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2509, DW_AT_type(*$C$DW$T$624)
$C$DW$T$625	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$625, DW_AT_type(*$C$DW$2509)

$C$DW$T$626	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$626, DW_AT_type(*$C$DW$T$625)
	.dwattr $C$DW$T$626, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$626, DW_AT_byte_size(0x200)
$C$DW$2510	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$2510, DW_AT_upper_bound(0xff)
	.dwendtag $C$DW$T$626


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_name("QueueLists")
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
$C$DW$2511	.dwtag  DW_TAG_member
	.dwattr $C$DW$2511, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2511, DW_AT_name("Position")
	.dwattr $C$DW$2511, DW_AT_TI_symbol_name("_Position")
	.dwattr $C$DW$2511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2512	.dwtag  DW_TAG_member
	.dwattr $C$DW$2512, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2512, DW_AT_name("Weight")
	.dwattr $C$DW$2512, DW_AT_TI_symbol_name("_Weight")
	.dwattr $C$DW$2512, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2513	.dwtag  DW_TAG_member
	.dwattr $C$DW$2513, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$2513, DW_AT_name("Next")
	.dwattr $C$DW$2513, DW_AT_TI_symbol_name("_Next")
	.dwattr $C$DW$2513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2513, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$32

$C$DW$2514	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2514, DW_AT_type(*$C$DW$T$32)
$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$2514)
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x16)
$C$DW$T$631	.dwtag  DW_TAG_typedef, DW_AT_name("QueueList")
	.dwattr $C$DW$T$631, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$631, DW_AT_language(DW_LANG_C)
$C$DW$2515	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2515, DW_AT_type(*$C$DW$T$631)
$C$DW$T$632	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$632, DW_AT_type(*$C$DW$2515)
$C$DW$T$633	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$633, DW_AT_type(*$C$DW$T$632)
	.dwattr $C$DW$T$633, DW_AT_address_class(0x16)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name("ADCTRL1_BITS")
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
$C$DW$2516	.dwtag  DW_TAG_member
	.dwattr $C$DW$2516, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2516, DW_AT_name("rsvd1")
	.dwattr $C$DW$2516, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2516, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2517	.dwtag  DW_TAG_member
	.dwattr $C$DW$2517, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2517, DW_AT_name("SEQ_CASC")
	.dwattr $C$DW$2517, DW_AT_TI_symbol_name("_SEQ_CASC")
	.dwattr $C$DW$2517, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2518	.dwtag  DW_TAG_member
	.dwattr $C$DW$2518, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2518, DW_AT_name("SEQ_OVRD")
	.dwattr $C$DW$2518, DW_AT_TI_symbol_name("_SEQ_OVRD")
	.dwattr $C$DW$2518, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2519	.dwtag  DW_TAG_member
	.dwattr $C$DW$2519, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2519, DW_AT_name("CONT_RUN")
	.dwattr $C$DW$2519, DW_AT_TI_symbol_name("_CONT_RUN")
	.dwattr $C$DW$2519, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2520	.dwtag  DW_TAG_member
	.dwattr $C$DW$2520, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2520, DW_AT_name("CPS")
	.dwattr $C$DW$2520, DW_AT_TI_symbol_name("_CPS")
	.dwattr $C$DW$2520, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2521	.dwtag  DW_TAG_member
	.dwattr $C$DW$2521, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2521, DW_AT_name("ACQ_PS")
	.dwattr $C$DW$2521, DW_AT_TI_symbol_name("_ACQ_PS")
	.dwattr $C$DW$2521, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2522	.dwtag  DW_TAG_member
	.dwattr $C$DW$2522, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2522, DW_AT_name("SUSMOD")
	.dwattr $C$DW$2522, DW_AT_TI_symbol_name("_SUSMOD")
	.dwattr $C$DW$2522, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
	.dwattr $C$DW$2522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2523	.dwtag  DW_TAG_member
	.dwattr $C$DW$2523, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2523, DW_AT_name("RESET")
	.dwattr $C$DW$2523, DW_AT_TI_symbol_name("_RESET")
	.dwattr $C$DW$2523, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2524	.dwtag  DW_TAG_member
	.dwattr $C$DW$2524, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2524, DW_AT_name("rsvd2")
	.dwattr $C$DW$2524, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2524, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2524, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$33


$C$DW$T$34	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$34, DW_AT_name("ADCTRL1_REG")
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
$C$DW$2525	.dwtag  DW_TAG_member
	.dwattr $C$DW$2525, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2525, DW_AT_name("all")
	.dwattr $C$DW$2525, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2526	.dwtag  DW_TAG_member
	.dwattr $C$DW$2526, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$2526, DW_AT_name("bit")
	.dwattr $C$DW$2526, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2526, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$34


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_name("ADCTRL2_BITS")
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
$C$DW$2527	.dwtag  DW_TAG_member
	.dwattr $C$DW$2527, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2527, DW_AT_name("EPWM_SOCB_SEQ2")
	.dwattr $C$DW$2527, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ2")
	.dwattr $C$DW$2527, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2528	.dwtag  DW_TAG_member
	.dwattr $C$DW$2528, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2528, DW_AT_name("rsvd1")
	.dwattr $C$DW$2528, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2528, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2529	.dwtag  DW_TAG_member
	.dwattr $C$DW$2529, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2529, DW_AT_name("INT_MOD_SEQ2")
	.dwattr $C$DW$2529, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
	.dwattr $C$DW$2529, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2530	.dwtag  DW_TAG_member
	.dwattr $C$DW$2530, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2530, DW_AT_name("INT_ENA_SEQ2")
	.dwattr $C$DW$2530, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
	.dwattr $C$DW$2530, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2531	.dwtag  DW_TAG_member
	.dwattr $C$DW$2531, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2531, DW_AT_name("rsvd2")
	.dwattr $C$DW$2531, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2531, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2532	.dwtag  DW_TAG_member
	.dwattr $C$DW$2532, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2532, DW_AT_name("SOC_SEQ2")
	.dwattr $C$DW$2532, DW_AT_TI_symbol_name("_SOC_SEQ2")
	.dwattr $C$DW$2532, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2533	.dwtag  DW_TAG_member
	.dwattr $C$DW$2533, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2533, DW_AT_name("RST_SEQ2")
	.dwattr $C$DW$2533, DW_AT_TI_symbol_name("_RST_SEQ2")
	.dwattr $C$DW$2533, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2534	.dwtag  DW_TAG_member
	.dwattr $C$DW$2534, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2534, DW_AT_name("EXT_SOC_SEQ1")
	.dwattr $C$DW$2534, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
	.dwattr $C$DW$2534, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2535	.dwtag  DW_TAG_member
	.dwattr $C$DW$2535, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2535, DW_AT_name("EPWM_SOCA_SEQ1")
	.dwattr $C$DW$2535, DW_AT_TI_symbol_name("_EPWM_SOCA_SEQ1")
	.dwattr $C$DW$2535, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2536	.dwtag  DW_TAG_member
	.dwattr $C$DW$2536, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2536, DW_AT_name("rsvd3")
	.dwattr $C$DW$2536, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$2536, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2537	.dwtag  DW_TAG_member
	.dwattr $C$DW$2537, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2537, DW_AT_name("INT_MOD_SEQ1")
	.dwattr $C$DW$2537, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
	.dwattr $C$DW$2537, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2538	.dwtag  DW_TAG_member
	.dwattr $C$DW$2538, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2538, DW_AT_name("INT_ENA_SEQ1")
	.dwattr $C$DW$2538, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
	.dwattr $C$DW$2538, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2539	.dwtag  DW_TAG_member
	.dwattr $C$DW$2539, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2539, DW_AT_name("rsvd4")
	.dwattr $C$DW$2539, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$2539, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2540	.dwtag  DW_TAG_member
	.dwattr $C$DW$2540, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2540, DW_AT_name("SOC_SEQ1")
	.dwattr $C$DW$2540, DW_AT_TI_symbol_name("_SOC_SEQ1")
	.dwattr $C$DW$2540, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2541	.dwtag  DW_TAG_member
	.dwattr $C$DW$2541, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2541, DW_AT_name("RST_SEQ1")
	.dwattr $C$DW$2541, DW_AT_TI_symbol_name("_RST_SEQ1")
	.dwattr $C$DW$2541, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2542	.dwtag  DW_TAG_member
	.dwattr $C$DW$2542, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2542, DW_AT_name("EPWM_SOCB_SEQ")
	.dwattr $C$DW$2542, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ")
	.dwattr $C$DW$2542, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2542, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$35


$C$DW$T$36	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$36, DW_AT_name("ADCTRL2_REG")
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
$C$DW$2543	.dwtag  DW_TAG_member
	.dwattr $C$DW$2543, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2543, DW_AT_name("all")
	.dwattr $C$DW$2543, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2544	.dwtag  DW_TAG_member
	.dwattr $C$DW$2544, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$2544, DW_AT_name("bit")
	.dwattr $C$DW$2544, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2544, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$36


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_name("ADCASEQSR_BITS")
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$2545	.dwtag  DW_TAG_member
	.dwattr $C$DW$2545, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2545, DW_AT_name("SEQ1_STATE")
	.dwattr $C$DW$2545, DW_AT_TI_symbol_name("_SEQ1_STATE")
	.dwattr $C$DW$2545, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2546	.dwtag  DW_TAG_member
	.dwattr $C$DW$2546, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2546, DW_AT_name("SEQ2_STATE")
	.dwattr $C$DW$2546, DW_AT_TI_symbol_name("_SEQ2_STATE")
	.dwattr $C$DW$2546, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
	.dwattr $C$DW$2546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2547	.dwtag  DW_TAG_member
	.dwattr $C$DW$2547, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2547, DW_AT_name("rsvd1")
	.dwattr $C$DW$2547, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2547, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2548	.dwtag  DW_TAG_member
	.dwattr $C$DW$2548, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2548, DW_AT_name("SEQ_CNTR")
	.dwattr $C$DW$2548, DW_AT_TI_symbol_name("_SEQ_CNTR")
	.dwattr $C$DW$2548, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2549	.dwtag  DW_TAG_member
	.dwattr $C$DW$2549, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2549, DW_AT_name("rsvd2")
	.dwattr $C$DW$2549, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2549, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2549, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$37


$C$DW$T$38	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$38, DW_AT_name("ADCASEQSR_REG")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
$C$DW$2550	.dwtag  DW_TAG_member
	.dwattr $C$DW$2550, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2550, DW_AT_name("all")
	.dwattr $C$DW$2550, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2551	.dwtag  DW_TAG_member
	.dwattr $C$DW$2551, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$2551, DW_AT_name("bit")
	.dwattr $C$DW$2551, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2551, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$38


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_name("ADCMAXCONV_BITS")
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$2552	.dwtag  DW_TAG_member
	.dwattr $C$DW$2552, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2552, DW_AT_name("MAX_CONV1")
	.dwattr $C$DW$2552, DW_AT_TI_symbol_name("_MAX_CONV1")
	.dwattr $C$DW$2552, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2553	.dwtag  DW_TAG_member
	.dwattr $C$DW$2553, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2553, DW_AT_name("MAX_CONV2")
	.dwattr $C$DW$2553, DW_AT_TI_symbol_name("_MAX_CONV2")
	.dwattr $C$DW$2553, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
	.dwattr $C$DW$2553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2554	.dwtag  DW_TAG_member
	.dwattr $C$DW$2554, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2554, DW_AT_name("rsvd1")
	.dwattr $C$DW$2554, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2554, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
	.dwattr $C$DW$2554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2554, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$39


$C$DW$T$40	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$40, DW_AT_name("ADCMAXCONV_REG")
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$2555	.dwtag  DW_TAG_member
	.dwattr $C$DW$2555, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2555, DW_AT_name("all")
	.dwattr $C$DW$2555, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2556	.dwtag  DW_TAG_member
	.dwattr $C$DW$2556, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$2556, DW_AT_name("bit")
	.dwattr $C$DW$2556, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2556, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_name("ADCCHSELSEQ1_BITS")
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$2557	.dwtag  DW_TAG_member
	.dwattr $C$DW$2557, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2557, DW_AT_name("CONV00")
	.dwattr $C$DW$2557, DW_AT_TI_symbol_name("_CONV00")
	.dwattr $C$DW$2557, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2558	.dwtag  DW_TAG_member
	.dwattr $C$DW$2558, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2558, DW_AT_name("CONV01")
	.dwattr $C$DW$2558, DW_AT_TI_symbol_name("_CONV01")
	.dwattr $C$DW$2558, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2559	.dwtag  DW_TAG_member
	.dwattr $C$DW$2559, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2559, DW_AT_name("CONV02")
	.dwattr $C$DW$2559, DW_AT_TI_symbol_name("_CONV02")
	.dwattr $C$DW$2559, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2560	.dwtag  DW_TAG_member
	.dwattr $C$DW$2560, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2560, DW_AT_name("CONV03")
	.dwattr $C$DW$2560, DW_AT_TI_symbol_name("_CONV03")
	.dwattr $C$DW$2560, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2560, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$41


$C$DW$T$42	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$42, DW_AT_name("ADCCHSELSEQ1_REG")
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$2561	.dwtag  DW_TAG_member
	.dwattr $C$DW$2561, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2561, DW_AT_name("all")
	.dwattr $C$DW$2561, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2562	.dwtag  DW_TAG_member
	.dwattr $C$DW$2562, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$2562, DW_AT_name("bit")
	.dwattr $C$DW$2562, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2562, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$42


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_name("ADCCHSELSEQ2_BITS")
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$2563	.dwtag  DW_TAG_member
	.dwattr $C$DW$2563, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2563, DW_AT_name("CONV04")
	.dwattr $C$DW$2563, DW_AT_TI_symbol_name("_CONV04")
	.dwattr $C$DW$2563, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2564	.dwtag  DW_TAG_member
	.dwattr $C$DW$2564, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2564, DW_AT_name("CONV05")
	.dwattr $C$DW$2564, DW_AT_TI_symbol_name("_CONV05")
	.dwattr $C$DW$2564, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2565	.dwtag  DW_TAG_member
	.dwattr $C$DW$2565, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2565, DW_AT_name("CONV06")
	.dwattr $C$DW$2565, DW_AT_TI_symbol_name("_CONV06")
	.dwattr $C$DW$2565, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2566	.dwtag  DW_TAG_member
	.dwattr $C$DW$2566, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2566, DW_AT_name("CONV07")
	.dwattr $C$DW$2566, DW_AT_TI_symbol_name("_CONV07")
	.dwattr $C$DW$2566, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2566, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$43


$C$DW$T$44	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$44, DW_AT_name("ADCCHSELSEQ2_REG")
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
$C$DW$2567	.dwtag  DW_TAG_member
	.dwattr $C$DW$2567, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2567, DW_AT_name("all")
	.dwattr $C$DW$2567, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2568	.dwtag  DW_TAG_member
	.dwattr $C$DW$2568, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$2568, DW_AT_name("bit")
	.dwattr $C$DW$2568, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2568, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$44


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_name("ADCCHSELSEQ3_BITS")
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
$C$DW$2569	.dwtag  DW_TAG_member
	.dwattr $C$DW$2569, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2569, DW_AT_name("CONV08")
	.dwattr $C$DW$2569, DW_AT_TI_symbol_name("_CONV08")
	.dwattr $C$DW$2569, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2569, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2570	.dwtag  DW_TAG_member
	.dwattr $C$DW$2570, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2570, DW_AT_name("CONV09")
	.dwattr $C$DW$2570, DW_AT_TI_symbol_name("_CONV09")
	.dwattr $C$DW$2570, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2571	.dwtag  DW_TAG_member
	.dwattr $C$DW$2571, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2571, DW_AT_name("CONV10")
	.dwattr $C$DW$2571, DW_AT_TI_symbol_name("_CONV10")
	.dwattr $C$DW$2571, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2572	.dwtag  DW_TAG_member
	.dwattr $C$DW$2572, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2572, DW_AT_name("CONV11")
	.dwattr $C$DW$2572, DW_AT_TI_symbol_name("_CONV11")
	.dwattr $C$DW$2572, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2572, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$45


$C$DW$T$46	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$46, DW_AT_name("ADCCHSELSEQ3_REG")
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
$C$DW$2573	.dwtag  DW_TAG_member
	.dwattr $C$DW$2573, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2573, DW_AT_name("all")
	.dwattr $C$DW$2573, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2573, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2574	.dwtag  DW_TAG_member
	.dwattr $C$DW$2574, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$2574, DW_AT_name("bit")
	.dwattr $C$DW$2574, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2574, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$46


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_name("ADCCHSELSEQ4_BITS")
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
$C$DW$2575	.dwtag  DW_TAG_member
	.dwattr $C$DW$2575, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2575, DW_AT_name("CONV12")
	.dwattr $C$DW$2575, DW_AT_TI_symbol_name("_CONV12")
	.dwattr $C$DW$2575, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2576	.dwtag  DW_TAG_member
	.dwattr $C$DW$2576, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2576, DW_AT_name("CONV13")
	.dwattr $C$DW$2576, DW_AT_TI_symbol_name("_CONV13")
	.dwattr $C$DW$2576, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2577	.dwtag  DW_TAG_member
	.dwattr $C$DW$2577, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2577, DW_AT_name("CONV14")
	.dwattr $C$DW$2577, DW_AT_TI_symbol_name("_CONV14")
	.dwattr $C$DW$2577, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2578	.dwtag  DW_TAG_member
	.dwattr $C$DW$2578, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2578, DW_AT_name("CONV15")
	.dwattr $C$DW$2578, DW_AT_TI_symbol_name("_CONV15")
	.dwattr $C$DW$2578, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2578, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$47


$C$DW$T$48	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$48, DW_AT_name("ADCCHSELSEQ4_REG")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$2579	.dwtag  DW_TAG_member
	.dwattr $C$DW$2579, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2579, DW_AT_name("all")
	.dwattr $C$DW$2579, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2579, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2580	.dwtag  DW_TAG_member
	.dwattr $C$DW$2580, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$2580, DW_AT_name("bit")
	.dwattr $C$DW$2580, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2580, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$48


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_name("ADCTRL3_BITS")
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
$C$DW$2581	.dwtag  DW_TAG_member
	.dwattr $C$DW$2581, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2581, DW_AT_name("SMODE_SEL")
	.dwattr $C$DW$2581, DW_AT_TI_symbol_name("_SMODE_SEL")
	.dwattr $C$DW$2581, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2582	.dwtag  DW_TAG_member
	.dwattr $C$DW$2582, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2582, DW_AT_name("ADCCLKPS")
	.dwattr $C$DW$2582, DW_AT_TI_symbol_name("_ADCCLKPS")
	.dwattr $C$DW$2582, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2582, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2583	.dwtag  DW_TAG_member
	.dwattr $C$DW$2583, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2583, DW_AT_name("ADCPWDN")
	.dwattr $C$DW$2583, DW_AT_TI_symbol_name("_ADCPWDN")
	.dwattr $C$DW$2583, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2584	.dwtag  DW_TAG_member
	.dwattr $C$DW$2584, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2584, DW_AT_name("ADCBGRFDN")
	.dwattr $C$DW$2584, DW_AT_TI_symbol_name("_ADCBGRFDN")
	.dwattr $C$DW$2584, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
	.dwattr $C$DW$2584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2585	.dwtag  DW_TAG_member
	.dwattr $C$DW$2585, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2585, DW_AT_name("rsvd1")
	.dwattr $C$DW$2585, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2585, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2585, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$49


$C$DW$T$50	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$50, DW_AT_name("ADCTRL3_REG")
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
$C$DW$2586	.dwtag  DW_TAG_member
	.dwattr $C$DW$2586, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2586, DW_AT_name("all")
	.dwattr $C$DW$2586, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2586, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2587	.dwtag  DW_TAG_member
	.dwattr $C$DW$2587, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$2587, DW_AT_name("bit")
	.dwattr $C$DW$2587, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2587, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$50


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_name("ADCST_BITS")
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
$C$DW$2588	.dwtag  DW_TAG_member
	.dwattr $C$DW$2588, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2588, DW_AT_name("INT_SEQ1")
	.dwattr $C$DW$2588, DW_AT_TI_symbol_name("_INT_SEQ1")
	.dwattr $C$DW$2588, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2588, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2589	.dwtag  DW_TAG_member
	.dwattr $C$DW$2589, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2589, DW_AT_name("INT_SEQ2")
	.dwattr $C$DW$2589, DW_AT_TI_symbol_name("_INT_SEQ2")
	.dwattr $C$DW$2589, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2589, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2590	.dwtag  DW_TAG_member
	.dwattr $C$DW$2590, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2590, DW_AT_name("SEQ1_BSY")
	.dwattr $C$DW$2590, DW_AT_TI_symbol_name("_SEQ1_BSY")
	.dwattr $C$DW$2590, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2590, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2591	.dwtag  DW_TAG_member
	.dwattr $C$DW$2591, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2591, DW_AT_name("SEQ2_BSY")
	.dwattr $C$DW$2591, DW_AT_TI_symbol_name("_SEQ2_BSY")
	.dwattr $C$DW$2591, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2591, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2592	.dwtag  DW_TAG_member
	.dwattr $C$DW$2592, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2592, DW_AT_name("INT_SEQ1_CLR")
	.dwattr $C$DW$2592, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
	.dwattr $C$DW$2592, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2592, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2593	.dwtag  DW_TAG_member
	.dwattr $C$DW$2593, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2593, DW_AT_name("INT_SEQ2_CLR")
	.dwattr $C$DW$2593, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
	.dwattr $C$DW$2593, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2593, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2594	.dwtag  DW_TAG_member
	.dwattr $C$DW$2594, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2594, DW_AT_name("EOS_BUF1")
	.dwattr $C$DW$2594, DW_AT_TI_symbol_name("_EOS_BUF1")
	.dwattr $C$DW$2594, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2594, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2595	.dwtag  DW_TAG_member
	.dwattr $C$DW$2595, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2595, DW_AT_name("EOS_BUF2")
	.dwattr $C$DW$2595, DW_AT_TI_symbol_name("_EOS_BUF2")
	.dwattr $C$DW$2595, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2595, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2596	.dwtag  DW_TAG_member
	.dwattr $C$DW$2596, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2596, DW_AT_name("rsvd1")
	.dwattr $C$DW$2596, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2596, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2596, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$51


$C$DW$T$52	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$52, DW_AT_name("ADCST_REG")
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$2597	.dwtag  DW_TAG_member
	.dwattr $C$DW$2597, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2597, DW_AT_name("all")
	.dwattr $C$DW$2597, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2597, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2598	.dwtag  DW_TAG_member
	.dwattr $C$DW$2598, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$2598, DW_AT_name("bit")
	.dwattr $C$DW$2598, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2598, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$52


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_name("ADCREFSEL_BITS")
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$2599	.dwtag  DW_TAG_member
	.dwattr $C$DW$2599, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2599, DW_AT_name("rsvd1")
	.dwattr $C$DW$2599, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2599, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x0e)
	.dwattr $C$DW$2599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2599, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2600	.dwtag  DW_TAG_member
	.dwattr $C$DW$2600, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2600, DW_AT_name("REF_SEL")
	.dwattr $C$DW$2600, DW_AT_TI_symbol_name("_REF_SEL")
	.dwattr $C$DW$2600, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
	.dwattr $C$DW$2600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2600, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$53


$C$DW$T$54	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$54, DW_AT_name("ADCREFSEL_REG")
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$2601	.dwtag  DW_TAG_member
	.dwattr $C$DW$2601, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2601, DW_AT_name("all")
	.dwattr $C$DW$2601, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2601, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2602	.dwtag  DW_TAG_member
	.dwattr $C$DW$2602, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$2602, DW_AT_name("bit")
	.dwattr $C$DW$2602, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2602, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$54


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_name("ADCOFFTRIM_BITS")
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
$C$DW$2603	.dwtag  DW_TAG_member
	.dwattr $C$DW$2603, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$2603, DW_AT_name("OFFSET_TRIM")
	.dwattr $C$DW$2603, DW_AT_TI_symbol_name("_OFFSET_TRIM")
	.dwattr $C$DW$2603, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
	.dwattr $C$DW$2603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2603, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2604	.dwtag  DW_TAG_member
	.dwattr $C$DW$2604, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2604, DW_AT_name("rsvd1")
	.dwattr $C$DW$2604, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2604, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
	.dwattr $C$DW$2604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2604, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$56


$C$DW$T$57	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$57, DW_AT_name("ADCOFFTRIM_REG")
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$2605	.dwtag  DW_TAG_member
	.dwattr $C$DW$2605, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2605, DW_AT_name("all")
	.dwattr $C$DW$2605, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2605, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2606	.dwtag  DW_TAG_member
	.dwattr $C$DW$2606, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$2606, DW_AT_name("bit")
	.dwattr $C$DW$2606, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2606, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$57


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_name("ADC_REGS")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x1e)
$C$DW$2607	.dwtag  DW_TAG_member
	.dwattr $C$DW$2607, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$2607, DW_AT_name("ADCTRL1")
	.dwattr $C$DW$2607, DW_AT_TI_symbol_name("_ADCTRL1")
	.dwattr $C$DW$2607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2607, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2608	.dwtag  DW_TAG_member
	.dwattr $C$DW$2608, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$2608, DW_AT_name("ADCTRL2")
	.dwattr $C$DW$2608, DW_AT_TI_symbol_name("_ADCTRL2")
	.dwattr $C$DW$2608, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2608, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2609	.dwtag  DW_TAG_member
	.dwattr $C$DW$2609, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$2609, DW_AT_name("ADCMAXCONV")
	.dwattr $C$DW$2609, DW_AT_TI_symbol_name("_ADCMAXCONV")
	.dwattr $C$DW$2609, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2609, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2610	.dwtag  DW_TAG_member
	.dwattr $C$DW$2610, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$2610, DW_AT_name("ADCCHSELSEQ1")
	.dwattr $C$DW$2610, DW_AT_TI_symbol_name("_ADCCHSELSEQ1")
	.dwattr $C$DW$2610, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$2610, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2611	.dwtag  DW_TAG_member
	.dwattr $C$DW$2611, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$2611, DW_AT_name("ADCCHSELSEQ2")
	.dwattr $C$DW$2611, DW_AT_TI_symbol_name("_ADCCHSELSEQ2")
	.dwattr $C$DW$2611, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2611, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2612	.dwtag  DW_TAG_member
	.dwattr $C$DW$2612, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$2612, DW_AT_name("ADCCHSELSEQ3")
	.dwattr $C$DW$2612, DW_AT_TI_symbol_name("_ADCCHSELSEQ3")
	.dwattr $C$DW$2612, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$2612, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2613	.dwtag  DW_TAG_member
	.dwattr $C$DW$2613, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$2613, DW_AT_name("ADCCHSELSEQ4")
	.dwattr $C$DW$2613, DW_AT_TI_symbol_name("_ADCCHSELSEQ4")
	.dwattr $C$DW$2613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$2613, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2614	.dwtag  DW_TAG_member
	.dwattr $C$DW$2614, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$2614, DW_AT_name("ADCASEQSR")
	.dwattr $C$DW$2614, DW_AT_TI_symbol_name("_ADCASEQSR")
	.dwattr $C$DW$2614, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$2614, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2615	.dwtag  DW_TAG_member
	.dwattr $C$DW$2615, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2615, DW_AT_name("ADCRESULT0")
	.dwattr $C$DW$2615, DW_AT_TI_symbol_name("_ADCRESULT0")
	.dwattr $C$DW$2615, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2615, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2616	.dwtag  DW_TAG_member
	.dwattr $C$DW$2616, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2616, DW_AT_name("ADCRESULT1")
	.dwattr $C$DW$2616, DW_AT_TI_symbol_name("_ADCRESULT1")
	.dwattr $C$DW$2616, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$2616, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2617	.dwtag  DW_TAG_member
	.dwattr $C$DW$2617, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2617, DW_AT_name("ADCRESULT2")
	.dwattr $C$DW$2617, DW_AT_TI_symbol_name("_ADCRESULT2")
	.dwattr $C$DW$2617, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$2617, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2618	.dwtag  DW_TAG_member
	.dwattr $C$DW$2618, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2618, DW_AT_name("ADCRESULT3")
	.dwattr $C$DW$2618, DW_AT_TI_symbol_name("_ADCRESULT3")
	.dwattr $C$DW$2618, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$2618, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2619	.dwtag  DW_TAG_member
	.dwattr $C$DW$2619, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2619, DW_AT_name("ADCRESULT4")
	.dwattr $C$DW$2619, DW_AT_TI_symbol_name("_ADCRESULT4")
	.dwattr $C$DW$2619, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2619, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2620	.dwtag  DW_TAG_member
	.dwattr $C$DW$2620, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2620, DW_AT_name("ADCRESULT5")
	.dwattr $C$DW$2620, DW_AT_TI_symbol_name("_ADCRESULT5")
	.dwattr $C$DW$2620, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$2620, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2621	.dwtag  DW_TAG_member
	.dwattr $C$DW$2621, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2621, DW_AT_name("ADCRESULT6")
	.dwattr $C$DW$2621, DW_AT_TI_symbol_name("_ADCRESULT6")
	.dwattr $C$DW$2621, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$2621, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2622	.dwtag  DW_TAG_member
	.dwattr $C$DW$2622, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2622, DW_AT_name("ADCRESULT7")
	.dwattr $C$DW$2622, DW_AT_TI_symbol_name("_ADCRESULT7")
	.dwattr $C$DW$2622, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$2622, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2623	.dwtag  DW_TAG_member
	.dwattr $C$DW$2623, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2623, DW_AT_name("ADCRESULT8")
	.dwattr $C$DW$2623, DW_AT_TI_symbol_name("_ADCRESULT8")
	.dwattr $C$DW$2623, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$2623, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2624	.dwtag  DW_TAG_member
	.dwattr $C$DW$2624, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2624, DW_AT_name("ADCRESULT9")
	.dwattr $C$DW$2624, DW_AT_TI_symbol_name("_ADCRESULT9")
	.dwattr $C$DW$2624, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$2624, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2625	.dwtag  DW_TAG_member
	.dwattr $C$DW$2625, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2625, DW_AT_name("ADCRESULT10")
	.dwattr $C$DW$2625, DW_AT_TI_symbol_name("_ADCRESULT10")
	.dwattr $C$DW$2625, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$2625, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2626	.dwtag  DW_TAG_member
	.dwattr $C$DW$2626, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2626, DW_AT_name("ADCRESULT11")
	.dwattr $C$DW$2626, DW_AT_TI_symbol_name("_ADCRESULT11")
	.dwattr $C$DW$2626, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$2626, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2627	.dwtag  DW_TAG_member
	.dwattr $C$DW$2627, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2627, DW_AT_name("ADCRESULT12")
	.dwattr $C$DW$2627, DW_AT_TI_symbol_name("_ADCRESULT12")
	.dwattr $C$DW$2627, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$2627, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2628	.dwtag  DW_TAG_member
	.dwattr $C$DW$2628, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2628, DW_AT_name("ADCRESULT13")
	.dwattr $C$DW$2628, DW_AT_TI_symbol_name("_ADCRESULT13")
	.dwattr $C$DW$2628, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$2628, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2629	.dwtag  DW_TAG_member
	.dwattr $C$DW$2629, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2629, DW_AT_name("ADCRESULT14")
	.dwattr $C$DW$2629, DW_AT_TI_symbol_name("_ADCRESULT14")
	.dwattr $C$DW$2629, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$2629, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2630	.dwtag  DW_TAG_member
	.dwattr $C$DW$2630, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2630, DW_AT_name("ADCRESULT15")
	.dwattr $C$DW$2630, DW_AT_TI_symbol_name("_ADCRESULT15")
	.dwattr $C$DW$2630, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$2630, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2631	.dwtag  DW_TAG_member
	.dwattr $C$DW$2631, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$2631, DW_AT_name("ADCTRL3")
	.dwattr $C$DW$2631, DW_AT_TI_symbol_name("_ADCTRL3")
	.dwattr $C$DW$2631, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$2631, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2632	.dwtag  DW_TAG_member
	.dwattr $C$DW$2632, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$2632, DW_AT_name("ADCST")
	.dwattr $C$DW$2632, DW_AT_TI_symbol_name("_ADCST")
	.dwattr $C$DW$2632, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$2632, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2633	.dwtag  DW_TAG_member
	.dwattr $C$DW$2633, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2633, DW_AT_name("rsvd1")
	.dwattr $C$DW$2633, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2633, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$2633, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2634	.dwtag  DW_TAG_member
	.dwattr $C$DW$2634, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2634, DW_AT_name("rsvd2")
	.dwattr $C$DW$2634, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2634, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$2634, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2635	.dwtag  DW_TAG_member
	.dwattr $C$DW$2635, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$2635, DW_AT_name("ADCREFSEL")
	.dwattr $C$DW$2635, DW_AT_TI_symbol_name("_ADCREFSEL")
	.dwattr $C$DW$2635, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$2635, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2636	.dwtag  DW_TAG_member
	.dwattr $C$DW$2636, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$2636, DW_AT_name("ADCOFFTRIM")
	.dwattr $C$DW$2636, DW_AT_TI_symbol_name("_ADCOFFTRIM")
	.dwattr $C$DW$2636, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$2636, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$58

$C$DW$2637	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2637, DW_AT_type(*$C$DW$T$58)
$C$DW$T$653	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$653, DW_AT_type(*$C$DW$2637)

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_name("ADC_RESULT_MIRROR_REGS")
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x10)
$C$DW$2638	.dwtag  DW_TAG_member
	.dwattr $C$DW$2638, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2638, DW_AT_name("ADCRESULT0")
	.dwattr $C$DW$2638, DW_AT_TI_symbol_name("_ADCRESULT0")
	.dwattr $C$DW$2638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2638, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2639	.dwtag  DW_TAG_member
	.dwattr $C$DW$2639, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2639, DW_AT_name("ADCRESULT1")
	.dwattr $C$DW$2639, DW_AT_TI_symbol_name("_ADCRESULT1")
	.dwattr $C$DW$2639, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2639, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2640	.dwtag  DW_TAG_member
	.dwattr $C$DW$2640, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2640, DW_AT_name("ADCRESULT2")
	.dwattr $C$DW$2640, DW_AT_TI_symbol_name("_ADCRESULT2")
	.dwattr $C$DW$2640, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2640, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2641	.dwtag  DW_TAG_member
	.dwattr $C$DW$2641, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2641, DW_AT_name("ADCRESULT3")
	.dwattr $C$DW$2641, DW_AT_TI_symbol_name("_ADCRESULT3")
	.dwattr $C$DW$2641, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$2641, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2642	.dwtag  DW_TAG_member
	.dwattr $C$DW$2642, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2642, DW_AT_name("ADCRESULT4")
	.dwattr $C$DW$2642, DW_AT_TI_symbol_name("_ADCRESULT4")
	.dwattr $C$DW$2642, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2642, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2643	.dwtag  DW_TAG_member
	.dwattr $C$DW$2643, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2643, DW_AT_name("ADCRESULT5")
	.dwattr $C$DW$2643, DW_AT_TI_symbol_name("_ADCRESULT5")
	.dwattr $C$DW$2643, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$2643, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2644	.dwtag  DW_TAG_member
	.dwattr $C$DW$2644, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2644, DW_AT_name("ADCRESULT6")
	.dwattr $C$DW$2644, DW_AT_TI_symbol_name("_ADCRESULT6")
	.dwattr $C$DW$2644, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$2644, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2645	.dwtag  DW_TAG_member
	.dwattr $C$DW$2645, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2645, DW_AT_name("ADCRESULT7")
	.dwattr $C$DW$2645, DW_AT_TI_symbol_name("_ADCRESULT7")
	.dwattr $C$DW$2645, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$2645, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2646	.dwtag  DW_TAG_member
	.dwattr $C$DW$2646, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2646, DW_AT_name("ADCRESULT8")
	.dwattr $C$DW$2646, DW_AT_TI_symbol_name("_ADCRESULT8")
	.dwattr $C$DW$2646, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$2646, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2647	.dwtag  DW_TAG_member
	.dwattr $C$DW$2647, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2647, DW_AT_name("ADCRESULT9")
	.dwattr $C$DW$2647, DW_AT_TI_symbol_name("_ADCRESULT9")
	.dwattr $C$DW$2647, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$2647, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2648	.dwtag  DW_TAG_member
	.dwattr $C$DW$2648, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2648, DW_AT_name("ADCRESULT10")
	.dwattr $C$DW$2648, DW_AT_TI_symbol_name("_ADCRESULT10")
	.dwattr $C$DW$2648, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$2648, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2649	.dwtag  DW_TAG_member
	.dwattr $C$DW$2649, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2649, DW_AT_name("ADCRESULT11")
	.dwattr $C$DW$2649, DW_AT_TI_symbol_name("_ADCRESULT11")
	.dwattr $C$DW$2649, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$2649, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2650	.dwtag  DW_TAG_member
	.dwattr $C$DW$2650, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2650, DW_AT_name("ADCRESULT12")
	.dwattr $C$DW$2650, DW_AT_TI_symbol_name("_ADCRESULT12")
	.dwattr $C$DW$2650, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$2650, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2651	.dwtag  DW_TAG_member
	.dwattr $C$DW$2651, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2651, DW_AT_name("ADCRESULT13")
	.dwattr $C$DW$2651, DW_AT_TI_symbol_name("_ADCRESULT13")
	.dwattr $C$DW$2651, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$2651, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2652	.dwtag  DW_TAG_member
	.dwattr $C$DW$2652, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2652, DW_AT_name("ADCRESULT14")
	.dwattr $C$DW$2652, DW_AT_TI_symbol_name("_ADCRESULT14")
	.dwattr $C$DW$2652, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$2652, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2653	.dwtag  DW_TAG_member
	.dwattr $C$DW$2653, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2653, DW_AT_name("ADCRESULT15")
	.dwattr $C$DW$2653, DW_AT_TI_symbol_name("_ADCRESULT15")
	.dwattr $C$DW$2653, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$2653, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$59

$C$DW$2654	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2654, DW_AT_type(*$C$DW$T$59)
$C$DW$T$655	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$655, DW_AT_type(*$C$DW$2654)

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_name("DEVICECNF_BITS")
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
$C$DW$2655	.dwtag  DW_TAG_member
	.dwattr $C$DW$2655, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2655, DW_AT_name("rsvd1")
	.dwattr $C$DW$2655, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2655, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
	.dwattr $C$DW$2655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2655, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2656	.dwtag  DW_TAG_member
	.dwattr $C$DW$2656, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2656, DW_AT_name("VMAPS")
	.dwattr $C$DW$2656, DW_AT_TI_symbol_name("_VMAPS")
	.dwattr $C$DW$2656, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2656, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2657	.dwtag  DW_TAG_member
	.dwattr $C$DW$2657, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2657, DW_AT_name("rsvd2")
	.dwattr $C$DW$2657, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2657, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2657, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2658	.dwtag  DW_TAG_member
	.dwattr $C$DW$2658, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2658, DW_AT_name("XRSn")
	.dwattr $C$DW$2658, DW_AT_TI_symbol_name("_XRSn")
	.dwattr $C$DW$2658, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2658, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2659	.dwtag  DW_TAG_member
	.dwattr $C$DW$2659, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2659, DW_AT_name("rsvd3")
	.dwattr $C$DW$2659, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$2659, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
	.dwattr $C$DW$2659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2659, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2660	.dwtag  DW_TAG_member
	.dwattr $C$DW$2660, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2660, DW_AT_name("rsvd4")
	.dwattr $C$DW$2660, DW_AT_TI_symbol_name("_rsvd4")
	.dwattr $C$DW$2660, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
	.dwattr $C$DW$2660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2660, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2661	.dwtag  DW_TAG_member
	.dwattr $C$DW$2661, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2661, DW_AT_name("ENPROT")
	.dwattr $C$DW$2661, DW_AT_TI_symbol_name("_ENPROT")
	.dwattr $C$DW$2661, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2661, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2661, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2662	.dwtag  DW_TAG_member
	.dwattr $C$DW$2662, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2662, DW_AT_name("MONPRIV")
	.dwattr $C$DW$2662, DW_AT_TI_symbol_name("_MONPRIV")
	.dwattr $C$DW$2662, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2662, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2662, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2663	.dwtag  DW_TAG_member
	.dwattr $C$DW$2663, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2663, DW_AT_name("rsvd5")
	.dwattr $C$DW$2663, DW_AT_TI_symbol_name("_rsvd5")
	.dwattr $C$DW$2663, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2663, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2663, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2664	.dwtag  DW_TAG_member
	.dwattr $C$DW$2664, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2664, DW_AT_name("EMU0SEL")
	.dwattr $C$DW$2664, DW_AT_TI_symbol_name("_EMU0SEL")
	.dwattr $C$DW$2664, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
	.dwattr $C$DW$2664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2664, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2665	.dwtag  DW_TAG_member
	.dwattr $C$DW$2665, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2665, DW_AT_name("EMU1SEL")
	.dwattr $C$DW$2665, DW_AT_TI_symbol_name("_EMU1SEL")
	.dwattr $C$DW$2665, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
	.dwattr $C$DW$2665, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2665, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2666	.dwtag  DW_TAG_member
	.dwattr $C$DW$2666, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2666, DW_AT_name("rsvd6")
	.dwattr $C$DW$2666, DW_AT_TI_symbol_name("_rsvd6")
	.dwattr $C$DW$2666, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
	.dwattr $C$DW$2666, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$2666, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$60


$C$DW$T$61	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$61, DW_AT_name("DEVICECNF_REG")
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
$C$DW$2667	.dwtag  DW_TAG_member
	.dwattr $C$DW$2667, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$2667, DW_AT_name("all")
	.dwattr $C$DW$2667, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2667, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2668	.dwtag  DW_TAG_member
	.dwattr $C$DW$2668, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$2668, DW_AT_name("bit")
	.dwattr $C$DW$2668, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2668, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$61


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_name("PARTID_BITS")
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
$C$DW$2669	.dwtag  DW_TAG_member
	.dwattr $C$DW$2669, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2669, DW_AT_name("PARTNO")
	.dwattr $C$DW$2669, DW_AT_TI_symbol_name("_PARTNO")
	.dwattr $C$DW$2669, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2669, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2670	.dwtag  DW_TAG_member
	.dwattr $C$DW$2670, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2670, DW_AT_name("PARTTYPE")
	.dwattr $C$DW$2670, DW_AT_TI_symbol_name("_PARTTYPE")
	.dwattr $C$DW$2670, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2670, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$62


$C$DW$T$63	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$63, DW_AT_name("PARTID_REG")
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
$C$DW$2671	.dwtag  DW_TAG_member
	.dwattr $C$DW$2671, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2671, DW_AT_name("all")
	.dwattr $C$DW$2671, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2671, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2672	.dwtag  DW_TAG_member
	.dwattr $C$DW$2672, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$2672, DW_AT_name("bit")
	.dwattr $C$DW$2672, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2672, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$63


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_name("DEV_EMU_REGS")
	.dwattr $C$DW$T$65, DW_AT_byte_size(0xd0)
$C$DW$2673	.dwtag  DW_TAG_member
	.dwattr $C$DW$2673, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$2673, DW_AT_name("DEVICECNF")
	.dwattr $C$DW$2673, DW_AT_TI_symbol_name("_DEVICECNF")
	.dwattr $C$DW$2673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2673, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2674	.dwtag  DW_TAG_member
	.dwattr $C$DW$2674, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$2674, DW_AT_name("PARTID")
	.dwattr $C$DW$2674, DW_AT_TI_symbol_name("_PARTID")
	.dwattr $C$DW$2674, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$2674, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2675	.dwtag  DW_TAG_member
	.dwattr $C$DW$2675, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2675, DW_AT_name("REVID")
	.dwattr $C$DW$2675, DW_AT_TI_symbol_name("_REVID")
	.dwattr $C$DW$2675, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$2675, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2676	.dwtag  DW_TAG_member
	.dwattr $C$DW$2676, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2676, DW_AT_name("PROTSTART")
	.dwattr $C$DW$2676, DW_AT_TI_symbol_name("_PROTSTART")
	.dwattr $C$DW$2676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$2676, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2677	.dwtag  DW_TAG_member
	.dwattr $C$DW$2677, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2677, DW_AT_name("PROTRANGE")
	.dwattr $C$DW$2677, DW_AT_TI_symbol_name("_PROTRANGE")
	.dwattr $C$DW$2677, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$2677, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2678	.dwtag  DW_TAG_member
	.dwattr $C$DW$2678, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$2678, DW_AT_name("rsvd2")
	.dwattr $C$DW$2678, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$2678, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$65

$C$DW$2679	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$2679, DW_AT_type(*$C$DW$T$65)
$C$DW$T$656	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$656, DW_AT_type(*$C$DW$2679)

$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_name("TCR_BITS")
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$2680	.dwtag  DW_TAG_member
	.dwattr $C$DW$2680, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2680, DW_AT_name("rsvd1")
	.dwattr $C$DW$2680, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$2680, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2680, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2681	.dwtag  DW_TAG_member
	.dwattr $C$DW$2681, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2681, DW_AT_name("TSS")
	.dwattr $C$DW$2681, DW_AT_TI_symbol_name("_TSS")
	.dwattr $C$DW$2681, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2681, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2682	.dwtag  DW_TAG_member
	.dwattr $C$DW$2682, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2682, DW_AT_name("TRB")
	.dwattr $C$DW$2682, DW_AT_TI_symbol_name("_TRB")
	.dwattr $C$DW$2682, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2682, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2683	.dwtag  DW_TAG_member
	.dwattr $C$DW$2683, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2683, DW_AT_name("rsvd2")
	.dwattr $C$DW$2683, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$2683, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x04)
	.dwattr $C$DW$2683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2683, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2684	.dwtag  DW_TAG_member
	.dwattr $C$DW$2684, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2684, DW_AT_name("SOFT")
	.dwattr $C$DW$2684, DW_AT_TI_symbol_name("_SOFT")
	.dwattr $C$DW$2684, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2684, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2685	.dwtag  DW_TAG_member
	.dwattr $C$DW$2685, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2685, DW_AT_name("FREE")
	.dwattr $C$DW$2685, DW_AT_TI_symbol_name("_FREE")
	.dwattr $C$DW$2685, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2685, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2686	.dwtag  DW_TAG_member
	.dwattr $C$DW$2686, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2686, DW_AT_name("rsvd3")
	.dwattr $C$DW$2686, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$2686, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
	.dwattr $C$DW$2686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2686, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2687	.dwtag  DW_TAG_member
	.dwattr $C$DW$2687, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2687, DW_AT_name("TIE")
	.dwattr $C$DW$2687, DW_AT_TI_symbol_name("_TIE")
	.dwattr $C$DW$2687, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2687, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2688	.dwtag  DW_TAG_member
	.dwattr $C$DW$2688, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2688, DW_AT_name("TIF")
	.dwattr $C$DW$2688, DW_AT_TI_symbol_name("_TIF")
	.dwattr $C$DW$2688, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$2688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2688, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$66


$C$DW$T$67	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$67, DW_AT_name("TCR_REG")
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
$C$DW$2689	.dwtag  DW_TAG_member
	.dwattr $C$DW$2689, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2689, DW_AT_name("all")
	.dwattr $C$DW$2689, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$2689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2689, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$2690	.dwtag  DW_TAG_member
	.dwattr $C$DW$2690, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$2690, DW_AT_name("bit")
	.dwattr $C$DW$2690, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$2690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$2690, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$67


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_name("TPR_BITS")
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
$C$DW$2691	.dwtag  DW_TAG_member
	.dwattr $C$DW$2691, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$2691, DW_AT_name("TDDR")
	.dwattr $C$DW$2691, DW_AT_TI_symbol_name("_TDDR")
	.dwattr $C$DW$2691, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
	.dwattr $C$DW$2691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
